app/views/users/my_items.html.erb

SELECT "items".* FROM "items" WHERE "items"."user_id" = ?  [["user_id", 1]]
---
<body>
<% @user.items.each do |item|%>