app/controllers/bookings_controller.rb

    def show
        @booking = Booking.find params[:id]
---
SELECT  "bookings".* FROM "bookings" WHERE "bookings"."id" = ? LIMIT ?  [["id", 40], ["LIMIT", 1]]

    def create_booking
        borrower = User.find(session[:user_id])
        item = Item.find params[:item_id]
        booking = Booking.new
        booking.user = borrower
        booking.item = item
        booking.save
        item.available = false
        item.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "bookings" ("created_at", "updated_at", "user_id", "item_id") VALUES (?, ?, ?, ?)  [["created_at", "2019-06-18 11:35:16.462953"], ["updated_at", "2019-06-18 11:35:16.462953"], ["user_id", 1], ["item_id", 2]]
UPDATE "items" SET "available" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["available", 0], ["updated_at", "2019-06-18 13:13:49.022132"], ["id", 3]]

    def return_item
        booking = Booking.find params[:booking_id]
        item = Item.find params[:item_id]
        item.available = true
        booking.booking_completed = true
        item.save
        booking.save
---
SELECT  "bookings".* FROM "bookings" WHERE "bookings"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "items" SET "available" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["available", 1], ["updated_at", "2019-06-19 10:21:38.627359"], ["id", 7]]
UPDATE "bookings" SET "booking_completed" = ?, "updated_at" = ? WHERE "bookings"."id" = ?  [["booking_completed", 1], ["updated_at", "2019-06-18 16:57:52.787872"], ["id", 13]]