app/controllers/items_controller.rb

SELECT "items".* FROM "items"
---
    def index
        @items = Item.all.select{ |item| (item.user_id != session[:user_id] && item.available) }

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "items" ("name", "created_at", "updated_at", "user_id", "description") VALUES (?, ?, ?, ?, ?)  [["name", "asd"], ["created_at", "2019-06-20 09:14:11.008535"], ["updated_at", "2019-06-20 09:14:11.008535"], ["user_id", 1], ["description", "asd"]]
UPDATE "items" SET "updated_at" = ? WHERE "items"."id" = ?  [["updated_at", "2019-06-19 09:38:17.547994"], ["id", 3]]
---
    def create
      user = User.find(session[:user_id])
      @item = Item.create(answer_params)
      @item.user = user
      @item.save

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
      @item = Item.find params[:id]

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def edit
      @item = Item.find params[:id]

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "items" SET "name" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["name", "Macbook"], ["updated_at", "2019-06-19 22:29:59.961575"], ["id", 2]]
---
    def update
      @item = Item.find params[:id]
      if @item.update(:image, :description)

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "items" WHERE "items"."id" = ?  [["id", 1]]
---
    def destroy
      @item = Item.find params[:id]
      @item.destroy