app/controllers/reviews_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "bookings".* FROM "bookings" WHERE "bookings"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
INSERT INTO "reviews" ("description", "user_id", "booking_id") VALUES (?, ?, ?)  [["description", "lol"], ["user_id", 2], ["booking_id", 15]]
---
    def create
        reviewer = User.find(session[:user_id])
        booking = Booking.find params[:review][:booking_id]
        @review = Review.create(params.require(:review).permit(:description, :booking_id, :user_id))

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
    def show
        @review = Review.find params[:id]