app/controllers/users_controller.rb

INSERT INTO "users" ("first_name", "last_name", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["first_name", "kik"], ["last_name", "iuo"], ["email", "asdf@as.com"], ["password", "asd"], ["created_at", "2019-06-14 14:02:10.542805"], ["updated_at", "2019-06-14 14:02:10.542805"]]
---
    def create
        @user = User.create(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def edit
        @user = User.find params[:id]

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def welcome
        @user = User.find(session[:user_id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def my_items
        @user = User.find(session[:user_id])

SELECT "bookings".* FROM "bookings"
---
    def my_bookings
        @bookings = Booking.all.select{ |booking| (booking.user_id == session[:user_id] && !booking.booking_completed)}

SELECT "bookings".* FROM "bookings"
---
    def bookings_history
        @bookings = Booking.all.select{ |booking| (booking.user_id == session[:user_id] && booking.booking_completed)}